---
kind: method
id: M:Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.GetAnalyticalToPhysicalAssociationManager(Autodesk.Revit.DB.Document)
source: html/a0df87ca-af1c-a17f-7f8c-e6a7af41a267.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.GetAnalyticalToPhysicalAssociationManager Method

Returns the AnalyticalToPhysicalAssociationManager for this document.

## Syntax (C#)
```csharp
public static AnalyticalToPhysicalAssociationManager GetAnalyticalToPhysicalAssociationManager(
	Document doc
)
```

## Parameters
- **doc** (`Autodesk.Revit.DB.Document`) - Revit document.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null